[AAFLPurifierArmorImmunities X2AbilityTemplate]
LocFriendlyName = "Purifier Immunities"
LocHelpText = "ADVENT Purifier Armor grants the wearer immunity to fire, standard poison and radiation."
LocLongDescription = "ADVENT Purifier Armor grants the wearer immunity to fire, standard poison and radiation."
LocPromotionPopupText = "<Bullet/> The poison that this armor provides protection against is only the standard kind, such as the poison produced by regular Vipers or Celatids. The wearer is still vulnerable to Chryssalid poison and Elerium poison."

[AdventPurifierArmor X2ArmorTemplate]
FriendlyName="ADVENT Purifier Armor"
FriendlyNamePlural="ADVENT Purifier Armors"
BriefSummary="The Purifier suit's thick plates combined with a layer of insulation grant complete immunity to fire, standard poison and radiation. Moreover, the armor was designed with the purpose of carrying extra fuel via a back-mounted canister. It incorporates a superior fuel line, granting the wearer 3 bonus charges of their Canister's ability, if available."
TacticalText="<Bullet/> The Purifier suit's thick plates combined with a layer of insulation grant complete immunity to fire, standard poison and radiation. Moreover, the armor was designed with the purpose of carrying extra fuel via a back-mounted canister. It incorporates a superior fuel line, granting the wearer 3 bonus charges of their Canister's ability, if available."

[AdventPurifierArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="Protective Insulation"
LocLongDescription="The ADVENT Purifier's armor offers immunity to fire, poison and radiation, extra health and armor, and bonus charges for equipped Canisters."
LocHelpText="The ADVENT Purifier's armor offers immunity to fire, poison and radiation, extra health and armor, and bonus charges for equipped Canisters."
LocFlyOverText="The ADVENT Purifier's armor offers immunity to fire, poison and radiation, extra health and armor, and bonus charges for equipped Canisters."
LocPromotionPopupText="<Bullet/> The ADVENT Purifier's armor offers immunity to fire, poison and radiation, extra health and armor, and bonus charges for equipped Canisters."

[AdventCaptainArmor X2ArmorTemplate]
FriendlyName="ADVENT Officer Armor"
FriendlyNamePlural="ADVENT Officer Armors"
BriefSummary="The ADVENT Officer Armor's torso is reinforced with metal plates that grant a superior bonus to the soldier's health compared to the Trooper Armor. An incorporated targeting device allows the wearer to mark enemy targets, making them easier to hit."
TacticalText="<Bullet/> Soldiers may take advantage of scavenged ADVENT Officer gear in combat. Additionally, we may catch our enemy off guard with this new armor."

[AdventCaptainArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="Target Painter"
LocLongDescription="The ADVENT Officer's armor not only grants a solid health bonus, but incorporates a targeting device. This allows the wearer to mark an enemy target, increasing the aim of all attacks against that target temporarily."
LocHelpText="The ADVENT Officer's armor not only grants a solid health bonus, but incorporates a targeting device. This allows the wearer to mark an enemy target, increasing the aim of all attacks against that target temporarily."
LocFlyOverText="The ADVENT Officer's armor not only grants a solid health bonus, but incorporates a targeting device. This allows the wearer to mark an enemy target, increasing the aim of all attacks against that target temporarily."
LocPromotionPopupText="<Bullet/> The ADVENT Officer's armor not only grants a solid health bonus, but incorporates a targeting device. This allows the wearer to mark an enemy target, increasing the aim of all attacks against that target temporarily."

[AdventLancerArmor X2ArmorTemplate]
FriendlyName="ADVENT Stun Lancer Armor"
FriendlyNamePlural="ADVENT Stun Lancer Armors"
BriefSummary="The ADVENT Stun Lancer Armor offers a moderate health boost. However, its main appeal is its advanced mobility that even surpasses the Pathfinders' armor, making it ideal for a soldier that wants to get in close as fast as possible."
TacticalText="<Bullet/> Soldiers may take advantage of scavenged ADVENT Stun Lancer gear in combat. Additionally, we may catch our enemy off guard with this new armor."

[AdventLancerArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="Composite Materials"
LocLongDescription="The ADVENT Stun Lancer's armor offers increased mobility and health."
LocHelpText="The ADVENT Stun Lancer's armor offers increased mobility and health."
LocFlyOverText="The ADVENT Stun Lancer's armor offers increased mobility and health."
LocPromotionPopupText="<Bullet/> The ADVENT Stun Lancer's armor offers increased mobility and health."

[AdventShieldbearerArmor X2ArmorTemplate]
FriendlyName="ADVENT Shieldbearer Armor"
FriendlyNamePlural="ADVENT Shieldbearer Armors"
BriefSummary="The Shieldbearer's armor contains advanced shielding technology in addition to its impressive durability. After several failed attempts to reverse engineer the energy shield generators, we are unable to adapt the technology to other applications beyond this suit of armor. Part of the difficulty is in the limited availability of samples and a very complex deactivation protocol that we have been unable to crack. Each attempt results in a lost generator. At this point, I recommend we settle for reinstating them without extracting cores from the refurbished armor."
TacticalText="<Bullet/> The Shieldbearer's armor contains advanced shielding technology in addition to its impressive durability. After several failed attempts to reverse engineer the energy shield generators, we are unable to adapt the technology to other applications beyond this suit of armor. Part of the difficulty is in the limited availability of samples and a very complex deactivation protocol that we have been unable to crack. Each attempt results in a lost generator. At this point, I recommend we settle for reinstating them without extracting cores from the refurbished armor."

[AdventShieldbearerArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="Heavy Defenses"
LocLongDescription="The ADVENT Shieldbearer's armor offers increased health and armor protection in addition to an innate shield generator."
LocHelpText="The ADVENT Shieldbearer's armor offers increased health and armor protection in addition to an innate shield generator."
LocFlyOverText="The ADVENT Shieldbearer's armor offers increased health and armor protection in addition to an innate shield generator."
LocPromotionPopupText="<Bullet/> The ADVENT Shieldbearer's armor offers increased health and armor protection in addition to an innate shield generator."

[AdventPriestArmor X2ArmorTemplate]
FriendlyName="ADVENT Priest Armor"
FriendlyNamePlural="ADVENT Priest Armors"
BriefSummary="The Priests' armor contains advanced psionic technology. It is unclear to us if the users of this armor are truly psionically gifted, or if ADVENT's gene manipulation is at play. This armor is designed to amplify psionic potential, while also offering built in safeguard mechanisms. I assume the Elders wish to protect their so-called priests."
TacticalText="<Bullet/> The Priests' armor contains advanced psionic technology. It is unclear to us if the users of this armor are truly psionically gifted, or if ADVENT's gene manipulation is at play. This armor is designed to amplify psionic potential, while also offering built in safeguard mechanisms. I assume the Elders wish to protect their so-called priests."


[AdventPriestArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="Psionic-Amplification"
LocLongDescription="The ADVENT Priest's armor offers increased psi potential and an innate Sustain protocol."
LocHelpText=" The ADVENT Priest's armor offers increased psi potential and an innate Sustain protocol."
LocFlyOverText="The ADVENT Priest's armor offers increased psi potential and an innate Sustain protocol."
LocPromotionPopupText="<Bullet/> The ADVENT Priest's armor offers increased psi potential and an innate Sustain protocol."
